###############################################################
# Enterprise SOC Lab
# Use Case : Network Share Discovery
# MITRE : T1135
###############################################################

###############################################################
# Detection
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
(Image="*\\net.exe" OR Image="*\\cmd.exe")
| eval Discovery=if(
searchmatch("net share") OR
searchmatch("net use") OR
searchmatch("net view") OR
searchmatch("SYSVOL") OR
searchmatch("NETLOGON"),
"Yes","No")
| search Discovery="Yes"
| table _time Computer User Image CommandLine
| sort - _time

###############################################################
# Alert
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
(Image="*\\net.exe" OR Image="*\\cmd.exe")
| eval Discovery=if(
searchmatch("net share") OR
searchmatch("net use") OR
searchmatch("net view") OR
searchmatch("SYSVOL") OR
searchmatch("NETLOGON"),
"Yes","No")
| search Discovery="Yes"
| stats count by Computer User CommandLine

###############################################################
# Investigation
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
User="CORP\\aabrev"
(Image="*\\net.exe")
| table _time Computer ParentImage Image CommandLine
| sort _time

###############################################################
# Dashboard Panel 1
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
(Image="*\\net.exe")
| eval Discovery=if(searchmatch("net share") OR searchmatch("net use") OR searchmatch("net view") OR searchmatch("SYSVOL") OR searchmatch("NETLOGON"),"Yes","No")
| search Discovery="Yes"
| stats count by CommandLine

###############################################################
# Dashboard Panel 2
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
(Image="*\\net.exe")
| eval Discovery=if(searchmatch("net share") OR searchmatch("net use") OR searchmatch("net view") OR searchmatch("SYSVOL") OR searchmatch("NETLOGON"),"Yes","No")
| search Discovery="Yes"
| stats count by User

###############################################################
# Dashboard Panel 3
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
(Image="*\\net.exe")
| eval Discovery=if(searchmatch("net share") OR searchmatch("net use") OR searchmatch("net view") OR searchmatch("SYSVOL") OR searchmatch("NETLOGON"),"Yes","No")
| search Discovery="Yes"
| timechart span=5m count

###############################################################
# Dashboard Panel 4
###############################################################

index=* source="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
(Image="*\\net.exe")
| eval Discovery=if(searchmatch("net share") OR searchmatch("net use") OR searchmatch("net view") OR searchmatch("SYSVOL") OR searchmatch("NETLOGON"),"Yes","No")
| search Discovery="Yes"
| stats count by Computer
